[
    {
      "id": 1,
      "name": "8-bit-bartender",
      "img": "./media/bartender.PNG",
      "detail": "This app helps an individual who likes to drink mixed drinks but wants to be healthy to give updated information on the ingredients and their nutritional info per mixed drink. This app used moment.js to display a retro clock in real time. Used basic HTML, CSS, and Javascript. The app used two different frameworks besides bootstrap to make the app responsive at all sizes but phone app size first in mind. Also used API calls in javascript to call in the information needed for the ingredients and nutritional info for the mixed drinks.",
      "deployLink": "https://eelektrick.github.io/8-bit-bartender/",
      "githubLink": "https://github.com/Eelektrick/8-bit-bartender"
    },
    {
      "id": 2,
      "name": "Flix-Nut",
      "img": "./media/finalConcept.png",
      "detail": " Phone app for an individual to give ratings for movies watched, another version of IMDB. However, this app is different as the rating of the movie is not given until the user gives a rating to avoid other users ratings effecting a more honest rating. Future plans would include more information and escription of each movie as well and share on social media. Used bootstrap to make the app for phone screen size first but be still be used on a computer, API calls for the movie information and ratings. Used basic HTML, CSS, and Javascript. Used MySql to save users email and passwords to log in. email: usertest@email.com password: 1234",
      "deployLink": "https://flix-nut.herokuapp.com/",
      "githubLink": "https://github.com/Eelektrick/flix-nut"
    },
    {
      "id": 3,
      "name": "Weather-dashboard",
      "img": "./media/dashboard.PNG",
      "detail": "User wants to check the weather of the current day and the next five day forecast, only needs to enter the city desired in the search bar. Used basic HTML, CSS, and Javascript. Used local storage to save recent search city names if not a database is available. Used AJAX and API call to search and find the city weather typed in for the user. Used moment.js to shopw the current month, day, and year.",
      "deployLink": "https://eelektrick.github.io/weather-dashboard/",
      "githubLink": "https://github.com/Eelektrick/weather-dashboard"
    },
    {
      "id": 4,
      "name": "Gluttony-of-Burgers",
      "img": "./media/screenshot.PNG",
      "detail": "User can list and save the burger they want to make and eat. After the user eats the burger the user can click on the devour it button to store the burger in the eaten/devoured list. Used basic HTML, CSS, and Javascript. Used MySQL to save the burger create and if it was devoured or not. Used handlebars to create the webpage design. Used express with express handlebars and, used server.js and package.json to run code on heroku.",
      "deployLink": "https://gluttony-of-burgers.herokuapp.com/",
      "githubLink": "https://github.com/Eelektrick/burger"
    },
    {
      "id": 5,
      "name": "Work day scheduler",
      "img": "./media/scheduler.PNG",
      "detail": " A daily work schedule the user enters info on a hourly basis what their schedule will be for the day. Each hour changes the hours colored bar to indicate when the time has passed or yet to come. Used basic HTML, CSS, and Javascript. Used Moment.js to keep track what the current time and date is. Used local storage to save the infomation entered in the schedule.",
      "deployLink": "https://eelektrick.github.io/work-day-scheduler/",
      "githubLink": "https://github.com/Eelektrick/work-day-scheduler"
    },
    {
      "id": 6,
      "name": "Note-Taker",
      "img": "./media/notes.PNG",
      "detail": " Note taker allows the user to enter and delete notes asnd have the titles saved to the side to re enter old notes. Used basic HTML, CSS, and Javascript. Used routes to connect to the different API calls and html pages to be able to save the information and change from the greeting page to the notes taking area. Used server.js with express with package.json to connect to heroku.",
      "deployLink": "https://notetaker-11.herokuapp.com/",
      "githubLink": "https://github.com/Eelektrick/Note_Taker"
    }
]